In [3]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [4]:
#First three rows of the DF
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
#Last three rows of DF
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [12]:
#Shape of df
#shape is an attribute and not a method
df1.shape

(7, 3)

In [11]:
print("Number of rows:",df1.shape[0])
print("Number of columns:",df1.shape[1])

Number of rows: 7
Number of columns: 3

In [16]:
#Data types of all columns in dataset
df1.dtypes

Name      object
Marks      int64
Gender    object
dtype: object

In [17]:
#get the information about your dataframe like memory usage and data types, etc.
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [18]:
#get numm values from the dataset
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [19]:
#get count of null values column wise
df1.isnull().sum()
#here for sum function there is axis argument which is by default set to 0 i.e. column wise it gives sum of null values

Name      0
Marks     0
Gender    0
dtype: int64

In [20]:
#get count of null values column wise
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [22]:
#Overall statistics about th dataframe
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [24]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [25]:
#Find unique values from gender column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [26]:
#Find number of unique values from Gender
df1['Gender'].nunique()

2

In [29]:
#display count of unique values from gender
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [33]:
#student with marks >90
df1['Marks']>90

0     True
1    False
2     True
3    False
4    False
5    False
6     True
Name: Marks, dtype: bool

In [34]:
#student with marks >90
df1[df1['Marks']>90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [44]:
#student with marks betwen 90 and 100 including
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [46]:
#number of student with marks betwen 90 and 100 including
sum(df1['Marks'].between(90,100))

4

In [47]:
#find mean, minimum,maximum values from marks columns
df1['Marks'].mean()

92.14285714285714

In [48]:
df1['Marks'].min()

83

In [49]:
df1['Marks'].max()

99

In [59]:
#Apply method on dataframe
#dividing marks by 2 and adding new column
def dm(x):
    return x//2
df1['Marks'].apply(dm)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [61]:
def dm(x):
    return x//2
df1['Divide_by_two']=df1['Marks'].apply(dm)
df1

      Name  Marks  Gender  Divide_by_two
0  Priyang     98    Male             49
1   Aadhya     89  Female             44
2   Krisha     99  Female             49
3   Vedant     87    Male             43
4   Parshv     90    Male             45
5   Mittal     83  Female             41
6  Archana     99  Female             49

In [62]:
#Using inbuild method len to find number of length of name column
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [64]:
#Map function to replace male with 0 and female with 1
df1['Gender_number']=df1['Gender'].map({'Male':0,'Female':1})

In [65]:
df1

      Name  Marks  Gender  Divide_by_two  Gender_number
0  Priyang     98    Male             49              0
1   Aadhya     89  Female             44              1
2   Krisha     99  Female             49              1
3   Vedant     87    Male             43              0
4   Parshv     90    Male             45              0
5   Mittal     83  Female             41              1
6  Archana     99  Female             49              1

In [69]:
#Drop columns with axis=1 using drop method
#Here you can use inplace=True as a argument inside drop function to replicate changes in the original table
df1.drop('Divide_by_two',axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [70]:
#Display column names
df1.columns

Index(['Name', 'Marks', 'Gender', 'Divide_by_two'], dtype='object')

In [71]:
#Display indexes
df1.index

RangeIndex(start=0, stop=7, step=1)

In [72]:
#sort values of the marks column
#bydefauly in sort_values function is in ascending order
df1.sort_values('Marks')

      Name  Marks  Gender  Divide_by_two
5   Mittal     83  Female             41
3   Vedant     87    Male             43
1   Aadhya     89  Female             44
4   Parshv     90    Male             45
0  Priyang     98    Male             49
2   Krisha     99  Female             49
6  Archana     99  Female             49

In [76]:
#Sort values in descending order
df1.sort_values('Marks',ascending=False)

      Name  Marks  Gender  Divide_by_two
2   Krisha     99  Female             49
6  Archana     99  Female             49
0  Priyang     98    Male             49
4   Parshv     90    Male             45
1   Aadhya     89  Female             44
3   Vedant     87    Male             43
5   Mittal     83  Female             41

In [80]:
#Name and Marks of the female students
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99